
<!DOCTYPE html>
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <title>***</title>
  </head>
  <body>
<?php

  $a = array (
      0 => 'Ноль',
      1 => 'Один',
      2 => 'Два',
      3 => 'Аз', 
      4 => 'Буки', 
      5 => 'Веди', 
      6 => 'веди',
      7 => 'soda'
      );

  echo('<pre>');
  print_r($a);
  echo('</pre>');

$convertMap = array(
  'А' => 'а',    'Б' => 'б',    'В' => 'в',    'Г' => 'д',    'Д' => 'д',    'Е' => 'е',
  'Ё' => 'ё',    'Ж' => 'ж',    'З' => 'з',    'И' => 'и',    'Й' => 'й',    'К' => 'к',
  'Л' => 'л',    'М' => 'м',    'Н' => 'н',    'О' => 'о',    'П' => 'п',    'Р' => 'р',
  'С' => 'с',    'Т' => 'т',    'У' => 'у',    'Ф' => 'ф',    'Х' => 'х',    'Ц' => 'ц',
  'Ч' => 'ч',    'Ш' => 'ш',    'Щ' => 'щ',    'Ы' => 'ы',    'Ь' => 'ь',    'Ъ' => 'ъ',
  'Э' => 'э',    'Ю' => 'ю',    'Я' => 'я');


  for ($i=0; $i < count($a); $i++) {
    if (array_key_exists($a[$i][0].$a[$i][1],$convertMap))
    $a[$i] = $convertMap[$a[$i][0].$a[$i][1]].substr($a[$i], 2);
  }

  echo('<pre>');
  print_r($a);
  echo('</pre>');

?>

</body>
</html>